[
  "calendar",
  "darlal-switcher-plus",
  "github-embeds",
  "hide-folders",
  "janitor",
  "obsidian-editor-shortcuts",
  "obsidian-excalidraw-plugin",
  "obsidian-full-calendar",
  "obsidian-linter",
  "obsidian-outliner",
  "obsidian-reading-time",
  "obsidian-text-format",
  "obsidian-tomorrows-daily-note",
  "paste-link",
  "periodic-notes",
  "table-editor-obsidian"
]
