tap "felixKratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "awscli"
brew "commitizen"
brew "git"
brew "git-cliff"
brew "gnupg"
brew "go"
brew "iterm"
brew "pass"
brew "sketchybar"
brew "terraform"
brew "jq"
brew "wget"
brew "smudge/smudge/nightlight"
cask "anaconda"
vscode "alefragnani.project-manager"
vscode "alexowl.transparent-color-theme"
vscode "amodio.toggle-excluded-files"
vscode "anseki.vscode-color"
vscode "ardenivanov.svelte-intellisense"
vscode "ariesbe.afterdark"
vscode "BeardedBear.beardedtheme"
vscode "bradlc.vscode-tailwindcss"
vscode "BrandonKirbyson.vscode-animations"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "cpylua.language-postcss"
vscode "csstools.postcss"
vscode "dakshmiglani.hex-to-rgba"
vscode "DanielSanMedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ElAnandKumar.el-vsc-product-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "HookyQR.JSDocTagComplete"
vscode "idbartosz.darkpp-italic"
vscode "josee9988.minifyall"
vscode "kamikillerto.vscode-colorize"
vscode "lllllllqw.jsdoc"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "oouo-diogo-perdigao.docthis"
vscode "patricklee.vsnotes"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sldobri.bunker"
vscode "sleistner.vscode-fileutils"
vscode "svelte.svelte-vscode"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "Thomaz.preparing"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "vscode-icons-team.vscode-icons"
vscode "vunguyentuan.vscode-css-variables"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
vscode "yaelguilloux.vscode-commit-prompt"
vscode "yassh.copy-with-line-numbers"
vscode "yzhang.markdown-all-in-one"
