# -- ALWAYS FIRST ------------------------------------------- #
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
brew "mas"

# -- Things to set up while everything installs. ------------ #
cask "firefox"
cask "1password"
cask "visual-studio-code"
cask "iterm2"
brew "git"
cask "keyboard-maestro"
cask "obsidian"
cask "bartender"
cask "istat-menus"
brew "gh"

# -- Everything Else ---------------------------------------- #
brew "python@3.11"
brew "commitizen"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "smudge/smudge"
tap "tidbyt/tidbyt"
brew "lsd"
brew "act"
brew "xz"
brew "ca-certificates"
brew "docutils"
brew "docker"
brew "mpdecimal"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "libyaml"
brew "python-argcomplete"
brew "python-markupsafe"
brew "python-packaging"
brew "python-typing-extensions"
brew "python@3.12"
brew "pyyaml"
brew "git-cliff"
brew "git-interactive-rebase-tool"
brew "gnupg"
brew "go"
brew "htop"
brew "http-server"
brew "jq"
brew "m-cli"
brew "nvm"
brew "pass"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@15", restart_service: true, link: true
brew "pyenv"
brew "switchaudio-osx"
brew "wget"
brew "zlib"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/yabai"
brew "mongodb/brew/mongodb-community"
brew "smudge/smudge/nightlight"
cask "chromium"
cask "font-envy-code-r-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "ngrok"
cask "sf-symbols"
cask "vlc"
cask "gifox"
cask "itsycal"
cask "mousepose"
cask "copyclip"
cask "textexpander"
cask "geektool"

# -- Mac Apple Store ------------------------------------------- #
mas "Glucose Graph", id: 1668560499
mas "OmniFocus 4", id: 1542143627
mas "Pym", id: 1451733095
mas "SimpleMine Pro", id: 434808346
mas "NexiGo Webcam Settings", id: 1568831522
mas "We Love Lights for Philips Hue", id: 1479422551
mas "Noizio — Calm, Meditate, Sleep", id: 928871589
mas "Sim Daltonism", id: 693112260
mas "Classic Color Meter", id: 451640037

# -- VSCode Extensions ------------------------------------------- #
vscode "adzero.vscode-sievehighlight"
vscode "alefragnani.project-manager"
vscode "alexowl.transparent-color-theme"
vscode "amodio.toggle-excluded-files"
vscode "anseki.vscode-color"
vscode "ardenivanov.svelte-intellisense"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "BrandonKirbyson.vscode-animations"
vscode "ChakrounAnas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "cpylua.language-postcss"
vscode "crystal-spider.jsdoc-generator"
vscode "csstools.postcss"
vscode "dakshmiglani.hex-to-rgba"
vscode "DanielSanMedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "diogomoretti.titan-vscode-theme"
vscode "drcika.apc-extension"
vscode "EditorConfig.EditorConfig"
vscode "ElAnandKumar.el-vsc-product-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-svelte-snippets"
vscode "foxundermoon.shell-format"
vscode "hashicorp.terraform"
vscode "HookyQR.JSDocTagComplete"
vscode "idleberg.applescript"
vscode "josee9988.minifyall"
vscode "kamikillerto.vscode-colorize"
vscode "lllllllqw.jsdoc"
vscode "melishev.feather-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "oouo-diogo-perdigao.docthis"
vscode "patricklee.vsnotes"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "Postman.postman-for-vscode"
vscode "Rajeshwaran.developer-theme-dark"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ShejanMahamud.nightfall-glow"
vscode "sldobri.bunker"
vscode "sleistner.vscode-fileutils"
vscode "StackBuild.bazel-stack-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "TeteDeCactus.onepiece-dark-theme"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "Tyriar.sort-lines"
vscode "uloco.theme-bluloco-dark"
vscode "vscode-icons-team.vscode-icons"
vscode "vunguyentuan.vscode-css-variables"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "yaelguilloux.vscode-commit-prompt"
vscode "yassh.copy-with-line-numbers"
vscode "yzhang.markdown-all-in-one"
