adzero.vscode-sievehighlight
alefragnani.project-manager
alexowl.transparent-color-theme
amodio.toggle-excluded-files
anseki.vscode-color
ardenivanov.svelte-intellisense
bodil.prettier-toml
bradlc.vscode-tailwindcss
BrandonKirbyson.vscode-animations
ChakrounAnas.turbo-console-log
charliermarsh.ruff
christian-kohler.path-intellisense
Continue.continue
cpylua.language-postcss
crystal-spider.jsdoc-generator
csstools.postcss
dakshmiglani.hex-to-rgba
DanielSanMedium.dscodegpt
dbaeumer.vscode-eslint
diogomoretti.titan-vscode-theme
drcika.apc-extension
EditorConfig.EditorConfig
ElAnandKumar.el-vsc-product-icon-theme
esbenp.prettier-vscode
foxundermoon.shell-format
hashicorp.terraform
HookyQR.JSDocTagComplete
idleberg.applescript
josee9988.minifyall
kamikillerto.vscode-colorize
lllllllqw.jsdoc
melishev.feather-vscode
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
oouo-diogo-perdigao.docthis
patricklee.vsnotes
pflannery.vscode-versionlens
PKief.material-icon-theme
Postman.postman-for-vscode
redhat.vscode-xml
redhat.vscode-yaml
sldobri.bunker
sleistner.vscode-fileutils
StackBuild.bazel-stack-vscode
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tamasfe.even-better-toml
teabyii.ayu
techer.open-in-browser
TeteDeCactus.onepiece-dark-theme
tombonnike.vscode-status-bar-format-toggle
Tyriar.sort-lines
vscode-icons-team.vscode-icons
vunguyentuan.vscode-css-variables
WakaTime.vscode-wakatime
wayou.vscode-todo-highlight
wix.vscode-import-cost
xabikos.JavaScriptSnippets
yaelguilloux.vscode-commit-prompt
yassh.copy-with-line-numbers
yzhang.markdown-all-in-one