alefragnani.project-manager
alexowl.transparent-color-theme
amodio.toggle-excluded-files
anseki.vscode-color
ardenivanov.svelte-intellisense
ariesbe.afterdark
BeardedBear.beardedtheme
bradlc.vscode-tailwindcss
BrandonKirbyson.vscode-animations
ChakrounAnas.turbo-console-log
christian-kohler.path-intellisense
cpylua.language-postcss
csstools.postcss
dakshmiglani.hex-to-rgba
DanielSanMedium.dscodegpt
dbaeumer.vscode-eslint
drcika.apc-extension
eamodio.gitlens
ElAnandKumar.el-vsc-product-icon-theme
esbenp.prettier-vscode
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
HookyQR.JSDocTagComplete
idbartosz.darkpp-italic
idleberg.applescript
josee9988.minifyall
kamikillerto.vscode-colorize
lllllllqw.jsdoc
melishev.feather-vscode
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
oouo-diogo-perdigao.docthis
patricklee.vsnotes
pflannery.vscode-versionlens
PKief.material-icon-theme
rangav.vscode-thunder-client
redhat.vscode-yaml
sldobri.bunker
sleistner.vscode-fileutils
svelte.svelte-vscode
teabyii.ayu
techer.open-in-browser
Thomaz.preparing
tombonnike.vscode-status-bar-format-toggle
vscode-icons-team.vscode-icons
vunguyentuan.vscode-css-variables
WakaTime.vscode-wakatime
wayou.vscode-todo-highlight
xabikos.JavaScriptSnippets
yaelguilloux.vscode-commit-prompt
yassh.copy-with-line-numbers
yzhang.markdown-all-in-one
